# GetItems Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RadioButtonGroup..::..GetItems Method
RadioButtonGroup Class See Also
---
Gets the collection of ToggleButtons assigned to the RadioButtonGroup.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public IList<ToggleButton> GetItems()
```

Visual Basic
---
```text
Public Function GetItems As IList(Of ToggleButton)
```

Visual C++
---
```text
public:
IList<ToggleButton^>^ GetItems()
```

# Remarks
This is a copy of all the ToggleButtons assigned to this group.
# See Also
RadioButtonGroup Class
Autodesk.Revit.UI Namespace